accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/payments/GetPrepaidPeriodicCharges-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetPrepaidPeriodicCharges">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetPrepaidPeriodicChargesResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:Charge_List>
                  <!--1 or more repetitions:-->
                  <get:Charge_Node>
                     <!--Optional:-->
                     <get:Charge>?</get:Charge>
                     <!--Optional:-->
                     <get:State>?</get:State>
                     <!--Optional:-->
                     <get:Subscription_Date>?</get:Subscription_Date>
                     <!--Optional:-->
                     <get:Next_State_Change_Date>?</get:Next_State_Change_Date>
                     <!--Optional:-->
                     <get:Next_Charge_Date>?</get:Next_Charge_Date>
                     <!--Optional:-->
                     <get:Charges_Remaining>?</get:Charges_Remaining>
                  </get:Charge_Node>
               </get:Charge_List>
            </lcew:Body>
         </Response>
      </web:GetPrepaidPeriodicChargesResponse>
   </soapenv:Body>
</soapenv:Envelope>